In [2]:
import pandas as pd

a = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.Series(a)
df

A    [1, 2, 3]
B    [4, 5, 6]
dtype: object

In [3]:
a = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(a)
df

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
df = pd.read_csv("D:\Py Django\sample.csv")
df

    Name Brand Model  number
0    BMW    B1   NaN  4545.0
1   Benz   NaN    w2  5645.0
2    NaN    A1    w3  8989.0
3    BMW    B1    w1     NaN
4   Benz   Be1    w2  3445.0
5    NaN    B1    w1    45.0
6   Benz   Be1   NaN  5656.0
7    NaN   Be1    w2  3445.0
8    BMW    B1    w1    45.0
9   Benz   Be1   NaN  5656.0
10  Benz   Be1   NaN  5656.0
11   NaN   Be1    w2  3445.0
12   BMW    B1    w1    45.0
13  Benz   Be1   NaN  5656.0

In [5]:
df = pd.read_csv("D:\Py Django\profit_and_loss.csv")
# df.head(10)
# df.tail(10)
df

    Year  Revenue  Expenses  Profit/Loss
0   2015    30000     35000        -5000
1   2016    35000     36000        -1000
2   2017    40000     38000         2000
3   2018    45000     42000         3000
4   2019    48000     50000        -2000
5   2020    50000     30000        20000
6   2021    60000     35000        25000
7   2022    70000     40000        30000
8   2023    80000     45000        35000
9   2024    90000     50000        40000
10  2025   100000    110000       -10000
11  2026   110000    120000       -10000
12  2027   120000     65000        55000
13  2028   130000    140000       -10000
14  2029   140000     75000        65000
15  2030   150000    160000       -10000

In [6]:
df = pd.read_csv("D:\Py Django\sample.csv")
bg = df.add_prefix("Car_")
bg.add_suffix("_2024")

   Car_Name_2024 Car_Brand_2024 Car_Model_2024  Car_number_2024
0            BMW             B1            NaN           4545.0
1           Benz            NaN             w2           5645.0
2            NaN             A1             w3           8989.0
3            BMW             B1             w1              NaN
4           Benz            Be1             w2           3445.0
5            NaN             B1             w1             45.0
6           Benz            Be1            NaN           5656.0
7            NaN            Be1             w2           3445.0
8            BMW             B1             w1             45.0
9           Benz            Be1            NaN           5656.0
10          Benz            Be1            NaN           5656.0
11           NaN            Be1             w2           3445.0
12           BMW             B1             w1             45.0
13          Benz            Be1            NaN           5656.0

In [ ]:
df = pd.read_csv("D:\Py Django\sample.csv")

# Remove rows with any missing (NaN) values, but this doesn't modify the original DataFrame
df.dropna()

# Remove rows with any missing (NaN) values and modify the original DataFrame in place
df.dropna(inplace=True)

# Remove rows where there are missing values in the "Name" or "Model" columns
# This doesn't modify the original DataFrame, only returns a new one
df.dropna(subset=["Name","Model"])

# Replace all missing (NaN) values in the DataFrame with 0
# This doesn't modify the original DataFrame, only returns a new one
df.fillna(0)

# Replace all missing (NaN) values in the DataFrame with 0 and modify the original DataFrame
# The DataFrame 'df' is updated with NaN values replaced by 0
df.fillna(0, inplace=True)

# Replace missing (NaN) values in the "Name" column with the string "Tata"
# Modifies the "Name" column in the original DataFrame
df["Name"].fillna("Tata", inplace=True)

# Display the entire DataFrame
# Shows all rows and columns (subject to display settings)
df

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 4 to 12
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Brand   3 non-null      object
 2   Model   3 non-null      object
 3   number  3 non-null      float64
dtypes: float64(1), object(3)
memory usage: 120.0+ bytes

C:\Users\91702\AppData\Local\Temp\ipykernel_18980\1105684970.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Name"].fillna("Tata",inplace=True)

    Name Brand Model  number
4   Benz   Be1    w2  3445.0
8    BMW    B1    w1    45.0
12   BMW    B1    w1    45.0

In [34]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Display a concise summary of the DataFrame, including column names, non-null counts, and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Brand   13 non-null     object
 2   Model   9 non-null      object
 3   number  13 non-null     float64
dtypes: float64(1), object(3)
memory usage: 580.0+ bytes

In [ ]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Generate descriptive statistics for numerical columns, such as count, mean, std, min, max, etc.
# Only applies to numeric columns
df.describe()

In [ ]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Count non-null values in each column of the DataFrame
df.count()

In [ ]:
df = pd.read_csv("D:\Py Django\sample.csv")

# Return a list of column names in the DataFrame
df.columns

In [ ]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Return a list of the DataFrame's axes (row index and column labels)
# axes[0] is the row index, axes[1] is the column labels
df.axes

In [ ]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Return a tuple representing the DataFrame's dimensions (rows, columns)
df.shape

In [ ]:
df = pd.read_csv("D:\Py Django\sample.csv")
#Replace all occurrences of "Benz" with "Mahindra" in the "Name" column of the DataFrame
df["Name"].replace("Benz", "Mahindra", inplace=True)    
df

C:\Users\91702\AppData\Local\Temp\ipykernel_18980\3869056218.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Name"].replace("Benz", "Mahindra", inplace=True)

        Name Brand Model  number
0        BMW    B1   NaN  4545.0
1   Mahindra   NaN    w2  5645.0
2        NaN    A1    w3  8989.0
3        BMW    B1    w1     NaN
4   Mahindra   Be1    w2  3445.0
5        NaN    B1    w1    45.0
6   Mahindra   Be1   NaN  5656.0
7        NaN   Be1    w2  3445.0
8        BMW    B1    w1    45.0
9   Mahindra   Be1   NaN  5656.0
10  Mahindra   Be1   NaN  5656.0
11       NaN   Be1    w2  3445.0
12       BMW    B1    w1    45.0
13  Mahindra   Be1   NaN  5656.0

In [ ]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Select the row with index label 3 from the DataFrame
df.loc[3]

Name      BMW
Brand      B1
Model      w1
number    NaN
Name: 3, dtype: object

In [ ]:
df = pd.read_csv("D:\Py Django\sample.csv")
# Define a dictionary to map old column names to new column names
x = {"Brand":"Brand_Name"}
df.rename(columns=x)

    Name Brand_Name Model  number
0    BMW         B1   NaN  4545.0
1   Benz        NaN    w2  5645.0
2    NaN         A1    w3  8989.0
3    BMW         B1    w1     NaN
4   Benz        Be1    w2  3445.0
5    NaN         B1    w1    45.0
6   Benz        Be1   NaN  5656.0
7    NaN        Be1    w2  3445.0
8    BMW         B1    w1    45.0
9   Benz        Be1   NaN  5656.0
10  Benz        Be1   NaN  5656.0
11   NaN        Be1    w2  3445.0
12   BMW         B1    w1    45.0
13  Benz        Be1   NaN  5656.0